.include "m16def.inc" ; подключение библиотеки для работы с ATmega16
.list ; включение листинга
.def temp=r16 ; определение главного рабочего регистра
.def kold=r17
.def k___=r18
.def s___=r19
;--------------------------------------------
.cseg ; выбор сегмента программного кода
.org 0 ; установка текущего адреса на ноль
;--------------------------------------------
ldi temp,0x80 ; выключение компаратора
out acsr,temp
;--------------------------------------------
ldi temp,0x00	; 0 --> temp
out ddrd,temp	; Назначаем порт rd на ввод (00000000 --> ddrd)
ldi temp,0xFF	; 0xff --> temp
out ddrb,temp	; Назначаем порт rb на вывод (11111111 --> ddrb)
out portd,temp	; Подключаем подтягивающие резисторы (11111111 --> portd)
;---------------------------------------------
ldi		kold, 0x00	; 0--->kold
ldi		s___, 0x00	; 0--->s___
out		portb, s___	; Вывели s___(=0)
;---------------------------------------------
read:			;
in		k___, pind	; Считали содержимое порта pd (--->k___)
cp		k___, kold	; Сравнили k___ и kold
breq	read		; Если k___=kold, read
tst		kold		; Проверили kold
brne	remem		; Если kold!=0, remen
tst		k___		; Проверили k___
breq	remem		; Если k___=0, remem
jmp		lbl1		;
;---------------------------------------------
remem:			;
mov	kold, k___	; Записали k___ в kold
jmp		read		; Вернулись в read
;---------------------------------------------
lbl1:				;
cpi		k___, 0x01	; Сравнили k___ и 1
brne	lbl2		; Если k___!=1, lbl2
cpi		s___, 0x09	; Сравнили s___ и 9
breq	print		; Если s___=9, Вывод
cpi     s___, 0x0F  ; Сравнили s___ и F
breq    print       ; Если s___=F, то Вывод			;
inc		s___		; s___+1--->s___
jmp		print		; Перешли на Вывод
;---------------------------------------------
lbl2:				;
cpi		k___, 0x02	; Сравнили k___ и 2
brne	lbl3		; Если k___!=2, lbl3
cpi		s___, 0x09	; Сравнили s___ и 9
brne	print		; Если s___ != 9, то Вывод
inc     s___        ; s___+1--->s___
jmp		print		; Перешли на Вывод
;---------------------------------------------

lbl3:
cpi     k___, 0x4   ; Cравнили k___ и 4
brne    remem       ; Если k___ != 4, то перешли на remem
cpi     s___, 0x0F  ; Сравнили s___ и F
breq    lbl3_1      ; Если s___ = F, то lbl3_1
cpi     s___, 0x0A  ; Сравнили s___ и A
breq    lbl3_2      ; Если s___ = A, то lbl3_2
cpi     s___, 0x09  ; Сравнили s___ и 9
breq    lbl3_3      ; Если s___ =9 , то lbl3_3
jmp     print       ; Перешли на Вывод

lbl3_1:
ldi     s___, 0x0A  ; s___:= A
jmp     print       ; Перешли на Вывод

lbl3_2:
ldi     s___, 0x05  ; s___:= 5
jmp     print       ; Перешли на Вывод

lbl3_3:
clr     s___        ; s___:= 0
jmp     print       ; Перешли на Вывод

;---------------------------------------------
print:			;
out		portb, s___	; Вывели s___ в порт pb
jmp		remem
